import numpy as np

# 1维数组
# 索引
a = np.array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
print(a[1])
# 切片 a[start:end:step]
print(a[1:8:2])

# 多维数组
# 索引
a_ori = np.array([[[1, 2], [3, 4]], [[5, 6], [7, 8]], [[9, 10], [11, 12]]])
print(a_ori[2][1][1])
print(a_ori[2, 1, 1])
print(a_ori[-1, -1, -1])
# 切片
# a_ori的0维全选，1维选第2个，2维选第2个，这些元素组成的新数组
print(a_ori[:, 1, 1])
print('--------------------')
# a_ori的0维选第1个到第2个，1维全选，2维全选，这些元素组成的新数组
print(a_ori[0:2, :, :])
print('--------------------')
# a_ori的0维选第0个到第2个步长为2，即0维选第1个和第3个，1维选第2个，2维全选，这些元素组成的新数组
print(a_ori[0:3:2, 1, :])
